##    pip install pymysql

###############################################################

####儲存資料####
import save_sql
name='dio'
alltime=900
count=60
cal=700.22
#名子name 總時長(秒)alltime 次數count 消耗熱量cal 
print("將資料輸入")
save_sql.save(name,alltime,count,cal)
print("輸入完成")
print("########################################################")
###############################################################

####讀取指定人資料####
#當無法讀取到使用者時，會自動導引到create使用者
import read_sql
print("讀取資料")

name=input("請輸入人名 或 ID:")
name,count,cal=read_sql.read_nameid(name)
print("名稱:"+str(name)+" 次數:"+str(count)+" 卡路里:"+str(cal))
print("資料讀取完畢,")
print("########################################################")
###############################################################

####建立使用者####

print("建立使用者")
import create_user
create_user.create()
print("使用者建立完畢")
print("########################################################")
###############################################################
